; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=66, out_folder=htg/blocksworld/training, instance_id=46, seed=2070, goal_proportion=0.1

(define (problem blocksworld-46)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 - object)
 (:init 
    (arm-empty)
    (clear b18)
    (on b18 b59)
    (on b59 b17)
    (on-table b17)
    (clear b46)
    (on b46 b15)
    (on-table b15)
    (clear b30)
    (on b30 b38)
    (on b38 b54)
    (on b54 b36)
    (on b36 b49)
    (on b49 b40)
    (on b40 b65)
    (on b65 b47)
    (on b47 b45)
    (on-table b45)
    (clear b9)
    (on b9 b48)
    (on b48 b22)
    (on-table b22)
    (clear b1)
    (on-table b1)
    (clear b31)
    (on b31 b62)
    (on-table b62)
    (clear b7)
    (on b7 b39)
    (on b39 b14)
    (on b14 b12)
    (on b12 b61)
    (on b61 b35)
    (on b35 b4)
    (on b4 b64)
    (on b64 b27)
    (on b27 b43)
    (on b43 b23)
    (on b23 b26)
    (on-table b26)
    (clear b25)
    (on b25 b16)
    (on b16 b32)
    (on b32 b20)
    (on b20 b52)
    (on-table b52)
    (clear b24)
    (on b24 b37)
    (on b37 b42)
    (on b42 b2)
    (on b2 b19)
    (on b19 b29)
    (on b29 b44)
    (on-table b44)
    (clear b58)
    (on b58 b57)
    (on b57 b28)
    (on b28 b34)
    (on b34 b53)
    (on b53 b55)
    (on-table b55)
    (clear b8)
    (on b8 b3)
    (on b3 b56)
    (on b56 b51)
    (on b51 b11)
    (on b11 b5)
    (on b5 b60)
    (on b60 b63)
    (on b63 b41)
    (on b41 b33)
    (on-table b33)
    (clear b21)
    (on-table b21)
    (clear b66)
    (on b66 b6)
    (on b6 b10)
    (on-table b10)
    (clear b13)
    (on b13 b50)
    (on-table b50))
 (:goal  (and 
    (clear b5)
    (on b5 b6)
    (on-table b6)
    (clear b3)
    (on b3 b1)
    (on b1 b2)
    (on-table b2)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 1 of 9
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 9
3. (unstack b3 b56)
   deleted: (on b3 b56) (clear b3) (arm-empty)
   added: (holding b3) (clear b56)
   goals met: 0 of 9
4. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 2 of 9
5. (unstack b66 b6)
   deleted: (on b66 b6) (clear b66) (arm-empty)
   added: (holding b66) (clear b6)
   goals met: 2 of 9
6. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 2 of 9
7. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 2 of 9
8. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 9
9. (unstack b56 b51)
   deleted: (on b56 b51) (clear b56) (arm-empty)
   added: (holding b56) (clear b51)
   goals met: 3 of 9
10. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 3 of 9
11. (unstack b51 b11)
   deleted: (on b51 b11) (clear b51) (arm-empty)
   added: (holding b51) (clear b11)
   goals met: 3 of 9
12. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 3 of 9
13. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 4 of 9
14. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 9
15. (unstack b5 b60)
   deleted: (on b5 b60) (clear b5) (arm-empty)
   added: (holding b5) (clear b60)
   goals met: 3 of 9
16. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 5 of 9
17. (unstack b24 b37)
   deleted: (on b24 b37) (clear b24) (arm-empty)
   added: (holding b24) (clear b37)
   goals met: 5 of 9
18. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 5 of 9
19. (unstack b37 b42)
   deleted: (on b37 b42) (clear b37) (arm-empty)
   added: (holding b37) (clear b42)
   goals met: 5 of 9
20. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 5 of 9
21. (unstack b42 b2)
   deleted: (on b42 b2) (clear b42) (arm-empty)
   added: (holding b42) (clear b2)
   goals met: 5 of 9
22. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 5 of 9
23. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 5 of 9
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 9
25. (unstack b7 b39)
   deleted: (on b7 b39) (clear b7) (arm-empty)
   added: (holding b7) (clear b39)
   goals met: 6 of 9
26. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 6 of 9
27. (unstack b39 b14)
   deleted: (on b39 b14) (clear b39) (arm-empty)
   added: (holding b39) (clear b14)
   goals met: 6 of 9
28. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 6 of 9
29. (unstack b14 b12)
   deleted: (on b14 b12) (clear b14) (arm-empty)
   added: (holding b14) (clear b12)
   goals met: 6 of 9
30. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 6 of 9
31. (unstack b12 b61)
   deleted: (on b12 b61) (clear b12) (arm-empty)
   added: (holding b12) (clear b61)
   goals met: 6 of 9
32. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 9
33. (unstack b61 b35)
   deleted: (on b61 b35) (clear b61) (arm-empty)
   added: (holding b61) (clear b35)
   goals met: 6 of 9
34. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 6 of 9
35. (unstack b35 b4)
   deleted: (on b35 b4) (clear b35) (arm-empty)
   added: (holding b35) (clear b4)
   goals met: 7 of 9
36. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 7 of 9
37. (unstack b4 b64)
   deleted: (on b4 b64) (clear b4) (arm-empty)
   added: (holding b4) (clear b64)
   goals met: 6 of 9
38. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 8 of 9
39. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 6 of 9
40. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 9
41. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 9
42. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 8 of 9
43. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 9
44. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 9 of 9
